app/controllers/searches_controller.rb

	def search
		if params[:model_name] == "ユーザー"
			keyword = params[:keyword]
			search_name = params[:search_name]
			@searched = User.search(keyword,search_name)
		elsif params[:model_name] == "ブック"
			keyword = params[:keyword]
			search_name = params[:search_name]
			@searched = Book.search(keyword,search_name)
---
SELECT "users"."id" FROM "users" WHERE (user_name = '完全一致')
SELECT "books".* FROM "books" WHERE (title LIKE '%aa%')
SELECT "users".* FROM "users" WHERE (name LIKE '%aa%')